backend/idl/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        users = User.all()

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        user = User.new(user_params)
        if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "strongBad"], ["email", "strong@homestarrunner.com"], ["updated_at", "2020-11-03 23:09:14.460180"], ["id", 5]]
---
    def update
        user = User.find_by(id: params[:id])
        if !user.nil?
            user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
---
    def delete
        user = User.find_by('id': [:params][:user][:id])
        if !user.nil?
            user.destroy