backend/idl/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def update
        user = User.find_by('id': [:params][:user][:id])
        if !user.empty?